# Contains Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Definitions..::..Contains Method
Definitions Class See Also
---
Tests for the existence of a definition within the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Contains(
	Definition definition
)
```

Visual Basic
---
```text
Public Function Contains ( _
	definition As Definition _
) As Boolean
```

Visual C++
---
```text
public:
bool Contains(
	Definition^ definition
)
```

# ### Parameters
definition
    Type: Autodesk.Revit.DB..::..DefinitionThe definition to look for.
# ### Return Value
True if the definition was found, false otherwise.
# See Also
Definitions Class
Autodesk.Revit.DB Namespace